ROLES-MANAGEMENT/Update-Role/updateRole.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="RoleService"
    targetNamespace="http://localhost:3019/update-role"
    xmlns:tns="http://localhost:3019/update-role"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns="http://schemas.xmlsoap.org/wsdl/">

    <message name="UpdateRoleRequest">
        <part name="role" type="xsd:string"/>
        <part name="userId" type="xsd:int"/>
    </message>
    
    <message name="UpdateRoleResponse">
        <part name="status" type="xsd:string"/>
    </message>

    <portType name="RoleServicePortType">
        <operation name="updateRole">
            <input message="tns:UpdateRoleRequest"/>
            <output message="tns:UpdateRoleResponse"/>
        </operation>
    </portType>

    <binding name="RoleServiceBinding" type="tns:RoleServicePortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="updateRole">
            <soap:operation soapAction="updateRole"/>
            <input>
                <soap:body use="literal"/>
            </input>
            <output>
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>

    <service name="RoleService">
        <port name="RoleServicePort" binding="tns:RoleServiceBinding">
            <soap:address location="http://localhost:3019/update-role"/>
        </port>
    </service>
</definitions>
